xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>AT32F4xx_DFP</name>
  <description>ArteryTek AT32F4 Series Device Support,Drivers</description>
  <url></url>
  <supportContact>support@keil.com</supportContact>

  <releases>
    <release version="1.3.7" date="2021-05-19">
      Just increase version
    </release>
    <release version="1.3.6" date="2021-03-18">
      Update svd files and StdPeriphs Library
    </release>
    <release version="1.3.5" date="2021-01-18">
      Update svd files and StdPeriphs Library
    </release>
    <release version="1.3.4" date="2020-10-15">
      Add AT32F407AV[CG]T7 and AT32F421PF[48]P7
    </release>
    <release version="1.3.3" date="2020-09-15">
      Update all *.FLM, increase sysclk to 48M
    </release>
    <release version="1.3.2" date="2020-08-15">
      Add AT32F421 subFamily to PACK
    </release>
    <release version="1.3.1" date="2020-02-25">
      Add TS32F401 series, Update flash algorithm files
    </release>
    <release version="1.3.0" date="2019-12-26">
      Add AT32F403A and AT32F407 subFamily to PACK.
    </release>
    <release version="1.2.1" date="2019-10-08">
      Add AT32F415CBU7 and AT32F415CCU7 to PACK.
	</release>
    <release version="1.2.0" date="2019-4-30">
      Add AT32F415 subFamily to PACK.
    </release>
    <release version="1.1.3" date="2019-4-15">
      Add AT32FEBK to F413 Series.
    </release>
    <release version="1.1.2" date="2019-3-13">
      Modify AT32F403CB sram to 32KB.
    </release>
    <release version="1.1.1" date="2019-2-21">
      Update AT32F403 FLM to PACK.
    </release>
    <release version="1.1.0" date="2018-10-29">
      Update AT32F413 subFamily to PACK.
    </release>
    <release version="1.0.3" date="2018-03-05">
      ADD AT32F413 subFamily to PACK.
    </release>
    <release version="1.0.2" date="2018-02-12">
      AT32F403 StdPeriphs replaced by V1.0.3.
    </release>
    <release version="1.0.1" date="2018-02-02">
      Add AT32F403CG Device.
    </release>
    <release version="1.0.0" date="2017-12-25">
      First Release version of AT32F4 Device Family Pack,Only For AT32F403xx.
    </release>
  </releases>

  <keywords>
    <keyword>ArteryTek</keyword>
    <keyword>AT32F403</keyword>
    <keyword>AT32F413</keyword>
    <keyword>AT32F415</keyword>
    <keyword>AT32F403A</keyword>
    <keyword>AT32F407</keyword>
    <keyword>AT32F421</keyword>
    <keyword>AT32F4</keyword>
    <keyword>AT32</keyword>
  </keywords>

  <devices>
    <family Dfamily="AT32F4 Series" Dvendor="ArteryTek:143">
      <processor Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
      <description>
AT32F4 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
AT32F4 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>
      <subFamily DsubFamily="AT32F403">
        <processor  Dclock="200000000"/>
        <debug      svd="SVD/AT32F403xx.svd"/>
        <description>
AT32F403 - ARM Cortex-M4 Core
  Frequency up to 200 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 128KB up to 1024 KB
  SRAM size up to 224KB

Low power management
  Power saving mode: sleep,standby,stop mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  Up to 3 x 12bit ADC

Integrated peripherals interface
  Up to 5 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 3 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDG, 1 x RTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'AT32F403CB'  ***************************** -->
        <device Dname="AT32F403CB">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Cx_MD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_128.FLM"               start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403CC'  ***************************** -->
        <device Dname="AT32F403CC">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Cx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_256.FLM"               start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403CE'  ***************************** -->
        <device Dname="AT32F403CE">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Cx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x80000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_512.FLM"               start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

