xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
        <!-- *************************  Device 'AT32F403CG'  ***************************** -->
        <device Dname="AT32F403CG">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Cx_XL"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"     startup="1"  default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_1024.FLM"              start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403RC'  ***************************** -->
        <device Dname="AT32F403RC">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Rx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_256.FLM"               start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403RE'  ***************************** -->
        <device Dname="AT32F403RE">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Rx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x80000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_512.FLM"               start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403RG'  ***************************** -->
        <device Dname="AT32F403RG">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Rx_XL"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"    startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_1024.FLM"              start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403VC'  ***************************** -->
        <device Dname="AT32F403VC">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Vx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_256.FLM"               start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403VE'  ***************************** -->
        <device Dname="AT32F403VE">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Vx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x80000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_512.FLM"               start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403VG'  ***************************** -->
        <device Dname="AT32F403VG">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Vx_XL"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"    startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_1024.FLM"              start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ZC'  ***************************** -->
        <device Dname="AT32F403ZC">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Zx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_256.FLM"               start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ZE'  ***************************** -->
        <device Dname="AT32F403ZE">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Zx_HD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x80000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_512.FLM"               start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ZG'  ***************************** -->
        <device Dname="AT32F403ZG">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403Zx_XL"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x100000"    startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x38000"     init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F403_1024.FLM"              start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403_UOB.FLM"               start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403_EXT_TYPE2_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>
      </subFamily>
