xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
        <!-- *************************  Device 'AT32FEBKC8'  ***************************** -->
        <device Dname="AT32FEBKC8">
          <compile header="Device/Include/at32f4xx.h"  define="AT32FEBKCx_MD"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F413_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F413_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F413_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="AT32F415">
        <processor  Dfpu="0" Dclock="150000000"/>
        <debug      svd="SVD/AT32F415xx.svd"/>
        <description>
AT32F415 - ARM Cortex-M4 Core
  Frequency up to 150 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 64KB up to 256KB
  SRAM size up to 32KB

Low power management
  Power saving mode: sleep,standby,stop mode
  Independent battery supply for real-calendar ERTC and backup register

Advanced analog peripherals
  Up to 2 x 12bit ADC

Integrated peripherals interface
  Up to 5 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI/I2S
  Up to 2 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDG, 1 x ERTC
  12-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'AT32F415K8U7-4'  ***************************** -->
        <device Dname="AT32F415K8U7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415K8U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415KBU7-4'  ***************************** -->
        <device Dname="AT32F415KBU7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415KBU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415KCU7-4'  ***************************** -->
        <device Dname="AT32F415KCU7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415KCU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415C8T7'  ***************************** -->
        <device Dname="AT32F415C8T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415C8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415CBT7'  ***************************** -->
        <device Dname="AT32F415CBT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415CBT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415CCT7'  ***************************** -->
        <device Dname="AT32F415CCT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F415CCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>
