xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
Integrated peripherals interface
  Up to 5 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 2 x 16 bit Advanced Timer, 1 x SysTick Timer, 10 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDG, 1 x RTC
  7-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'AT32F403ACCT7'  ***************************** -->
        <device Dname="AT32F403ACCT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACCU7'  ***************************** -->
        <device Dname="AT32F403ACCU7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACCU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACET7'  ***************************** -->
        <device Dname="AT32F403ACET7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACEU7'  ***************************** -->
        <device Dname="AT32F403ACEU7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACEU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACGT7'  ***************************** -->
        <device Dname="AT32F403ACGT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ACGU7'  ***************************** -->
        <device Dname="AT32F403ACGU7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ACGU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ARCT7'  ***************************** -->
        <device Dname="AT32F403ARCT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ARCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

