xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
        <!-- *************************  Device 'AT32F403ARET7'  ***************************** -->
        <device Dname="AT32F403ARET7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ARET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403ARGT7'  ***************************** -->
        <device Dname="AT32F403ARGT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403ARGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVCT7'  ***************************** -->
        <device Dname="AT32F403AVCT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403AVCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x40000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_256.FLM"                      start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVET7'  ***************************** -->
        <device Dname="AT32F403AVET7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403AVET7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x80000"     startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_512.FLM"                      start="0x08000000" size="0x80000"   default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>

        <!-- *************************  Device 'AT32F403AVGT7'  ***************************** -->
        <device Dname="AT32F403AVGT7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F403AVGT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"       size="0x100000"    startup="1"      default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"       size="0x38000"     init   ="0"      default="1"/>
          <algorithm name="Flash/AT32F403A_1024.FLM"                     start="0x08000000" size="0x100000"  default="1"/>
          <algorithm name="Flash/AT32F403A_UOB.FLM"                      start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE1_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP0_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/AT32F403A_EXT_TYPE2_REAMP1_GENERAL.FLM" start="0x08400000" size="0x1000000" default="0"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="AT32F407">
        <processor  Dfpu="1" Dclock="200000000"/>
        <debug      svd="SVD/AT32F407xx.svd"/>
        <description>
AT32F407 - ARM Cortex-M4 Core
  Frequency up to 240 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 256KB up to 1024 KB
  SRAM size up to 224KB

Low power management
  Power saving mode: sleep,standby,stop mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  Up to 3 x 12bit ADC

