xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
	  <subFamily DsubFamily="AT32F421">
        <processor  Dfpu="0" Dclock="120000000"/>
		<compile    header="Device/Include/at32f4xx.h"/>
		<debug      svd="SVD/AT32F421xx.svd"/>
        <description>
AT32F421 - ARM Cortex-M4 Core
  Frequency up to 120 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 16KB up to 64KB
  SRAM size up to 16KB

Low power management
  Power saving mode: sleep,standby,stop mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  Up to 1 x 12bit ADC 

Integrated peripherals interface
  Up to 2 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI/I2S 
  Up to 2 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 2 x WDG, 1 x RTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'AT32F421C8T7'  ***************************** -->
        <device Dname="AT32F421C8T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421C8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421C6T7'  ***************************** -->
        <device Dname="AT32F421C6T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421C6T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421C4T7'  ***************************** -->
        <device Dname="AT32F421C4T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421C4T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8T7'  ***************************** -->
        <device Dname="AT32F421K8T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K6T7'  ***************************** -->
        <device Dname="AT32F421K6T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K6T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4T7'  ***************************** -->
        <device Dname="AT32F421K4T7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K4T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8U7'  ***************************** -->
        <device Dname="AT32F421K8U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K6U7'  ***************************** -->
        <device Dname="AT32F421K6U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4U7'  ***************************** -->
        <device Dname="AT32F421K4U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8U7-4'  ***************************** -->
        <device Dname="AT32F421K8U7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K8U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

