xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
        <!-- *************************  Device 'AT32F421K6U7-4'  ***************************** -->
        <device Dname="AT32F421K6U7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K6U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4U7-4'  ***************************** -->
        <device Dname="AT32F421K4U7-4">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421K4U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F8P7'  ***************************** -->
        <device Dname="AT32F421F8P7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F8P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F6P7'  ***************************** -->
        <device Dname="AT32F421F6P7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F6P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F4P7'  ***************************** -->
        <device Dname="AT32F421F4P7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F4P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F8U7'  ***************************** -->
        <device Dname="AT32F421F8U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F6U7'  ***************************** -->
        <device Dname="AT32F421F6U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F4U7'  ***************************** -->
        <device Dname="AT32F421F4U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421F4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G8U7'  ***************************** -->
        <device Dname="AT32F421G8U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421G8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G6U7'  ***************************** -->
        <device Dname="AT32F421G6U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421G6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G4U7'  ***************************** -->
        <device Dname="AT32F421G4U7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421G4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421PF8P7'  ***************************** -->
        <device Dname="AT32F421PF8P7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421PF8P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421PF4P7'  ***************************** -->
        <device Dname="AT32F421PF4P7">
          <compile header="Device/Include/at32f4xx.h"  define="AT32F421PF4P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_SYSMEM_AP.FLM"              start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F421_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

      </subFamily>
    </family>
    <family Dfamily="TS32 Series" Dvendor="ArteryTek:143">
      <processor Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
      <description>
TS32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
TS32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>
      <subFamily DsubFamily="TS32F401">
        <processor  Dclock="200000000"/>
        <debug      svd="SVD/AT32F413xx.svd"/>
        <description>
TS32F401 - ARM Cortex-M4 Core
  Frequency up to 200 MHz
  Flash access zero wait state
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size from 64KB up to 256KB
  SRAM size up to 64KB

Low power management
  Power saving mode: sleep,standby,stop mode
  Independent battery supply for real-calendar RTC and backup register

Advanced analog peripherals
  Up to 2 x 12bit ADC

