xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
Integrated peripherals interface
  Up to 5 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI/I2S
  Up to 2 x I2C

On-chip resources
  Up to 2 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDG, 1 x RTC
  12-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'TS32F401CBU7'  ***************************** -->
        <device Dname="TS32F401CBU7">
          <compile header="Device/Include/at32f4xx.h"  define="TS32F401CBU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/TS32F401_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/TS32F401_UOB.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE1_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP0_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP0_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP0_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP0_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP0_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP1_1MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP1_2MB.FLM"   start="0x08400000" size="0x1000000" default="0"/> 
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP1_4MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP1_8MB.FLM"   start="0x08400000" size="0x1000000" default="0"/>
          <algorithm name="Flash/TS32F401_EXT_TYPE2_REAMP1_16MB.FLM"  start="0x08400000" size="0x1000000" default="0"/>
        </device>
      </subFamily>
    </family>
 </devices>

  <!-- examples section (optional for all Software Packs)-->
  <!--
  <examples>
  </examples>
  -->

  <conditions>
    <condition id="Compiler ARMCC">                                             <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

<!-- Series id conditions selecting ARM Compiler -->
    <condition id="AT32F4">
      <description>ArteryTek AT32F4xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F[4E][012B]*"/>
    </condition>

    <condition id="TS32F4">
      <description>ArteryTek AT32F4xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="TS32F401*"/>
    </condition>

    <condition id="AT32F403xx">
      <description>ArteryTek AT32F403xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F403[CRVZ]*"/>
    </condition>
<!-- EBK at F413 -->
    <condition id="AT32F413EBK">
      <description>ArteryTek AT32F413xx EBK Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32FEBK*"/>
    </condition>
    <condition id="AT32F413NOR">
      <description>ArteryTek AT32F413xx Normal Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F413*"/>
    </condition>
    <condition id="AT32F413xx">
      <description>ArteryTek AT32F413xx Series devices</description>
      <accept condition="AT32F413EBK"/>
      <accept condition="AT32F413NOR"/>
      <accept condition="TS32F401CBU7"/>
    </condition>

    <condition id="AT32F415xx">
      <description>ArteryTek AT32F415xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F415*"/>
    </condition>

    <condition id="AT32F403Axx">
      <description>ArteryTek AT32F403Axx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F403A*"/>
    </condition>

    <condition id="AT32F407xx">
      <description>ArteryTek AT32F407xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F407*"/>
    </condition>

    <condition id="AT32F421xx">
      <description>ArteryTek AT32F421xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="AT32F421*"/>
    </condition>
<!-- Series id conditions selecting ARM Compiler END -->

    <condition id="AT32F403 CX MD">
      <require Dvendor="ArteryTek:143" Dname="AT32F403CB"/>
    </condition>

