xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
    <condition id="AT32F403 CX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F403C[CE]"/>
    </condition>

    <condition id="AT32F403 RX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F403R[CE]"/>
    </condition>

    <condition id="AT32F403 VX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F403V[CE]"/>
    </condition>

    <condition id="AT32F403 ZX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F403Z[CE]"/>
    </condition>

    <condition id="AT32F403 CX XL">
      <require Dvendor="ArteryTek:143" Dname="AT32F403CG"/>
    </condition>

    <condition id="AT32F403 RX XL">
      <require Dvendor="ArteryTek:143" Dname="AT32F403RG"/>
    </condition>

    <condition id="AT32F403 VX XL">
      <require Dvendor="ArteryTek:143" Dname="AT32F403VG"/>
    </condition>

    <condition id="AT32F403 ZX XL">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ZG"/>
    </condition>

    <condition id="AT32F413 KX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413KC"/>
    </condition>

    <condition id="AT32F413 KX MD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413KB"/>
    </condition>

    <condition id="AT32F413 TX MD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413TB"/>
    </condition>

    <condition id="AT32F413 CX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413CC"/>
    </condition>

    <condition id="TS32F401CBU7">
      <require Dvendor="ArteryTek:143" Dname="TS32F401CBU7"/>
    </condition>

<!-- EBK at F413 -->
    <condition id="AT32F413 CX EBK">
      <require Dvendor="ArteryTek:143" Dname="AT32FEBKC8"/>
    </condition>
    <condition id="AT32F413 CX NOR">
      <require Dvendor="ArteryTek:143" Dname="AT32F413C[8B]"/>
    </condition>
    <condition id="AT32F413 CX MD">
      <accept condition="AT32F413 CX EBK"/>
      <accept condition="AT32F413 CX NOR"/>
    </condition>

    <condition id="AT32F413 RX HD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413RC"/>
    </condition>

    <condition id="AT32F413 RX MD">
      <require Dvendor="ArteryTek:143" Dname="AT32F413RB"/>
    </condition>

    <condition id="AT32F415K8U7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F415K8U7-4"/>
    </condition>

    <condition id="AT32F415KBU7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F415KBU7-4"/>
    </condition>

    <condition id="AT32F415KCU7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F415KCU7-4"/>
    </condition>

    <condition id="AT32F415C8T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415C8T7"/>
    </condition>

    <condition id="AT32F415CBT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415CBT7"/>
    </condition>

    <condition id="AT32F415CBU7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415CBU7"/>
    </condition>

    <condition id="AT32F415CCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415CCT7"/>
    </condition>

    <condition id="AT32F415CCU7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415CCU7"/>
    </condition>

    <condition id="AT32F415R8T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415R8T7"/>
    </condition>

    <condition id="AT32F415RBT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415RBT7"/>
    </condition>

    <condition id="AT32F415RCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415RCT7"/>
    </condition>

    <condition id="AT32F415R8T7-7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415R8T7-7"/>
    </condition>

    <condition id="AT32F415RBT7-7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415RBT7-7"/>
    </condition>

    <condition id="AT32F415RCT7-7">
      <require Dvendor="ArteryTek:143" Dname="AT32F415RCT7-7"/>
    </condition>

    <condition id="AT32F403ACCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACCT7"/>
    </condition>

    <condition id="AT32F403ACET7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACET7"/>
    </condition>


     <condition id="AT32F403ACGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACGT7"/>
    </condition>

    <condition id="AT32F403ACCU7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACCU7"/>
    </condition>

    <condition id="AT32F403ACEU7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACEU7"/>
    </condition>

     <condition id="AT32F403ACGU7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ACGU7"/>
    </condition>

    <condition id="AT32F403AVCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403AVCT7"/>
    </condition>

    <condition id="AT32F403AVET7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403AVET7"/>
    </condition>

    <condition id="AT32F403AVGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403AVGT7"/>
    </condition>

    <condition id="AT32F403ARCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ARCT7"/>
    </condition>

    <condition id="AT32F403ARET7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ARET7"/>
    </condition>

    <condition id="AT32F403ARGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F403ARGT7"/>
    </condition>

    <condition id="AT32F407RCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407RCT7"/>
    </condition>

    <condition id="AT32F407RET7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407RET7"/>
    </condition>

    <condition id="AT32F407RGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407RGT7"/>
    </condition>

    <condition id="AT32F407VCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407VCT7"/>
    </condition>

    <condition id="AT32F407VET7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407VET7"/>
    </condition>

    <condition id="AT32F407VGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407VGT7"/>
    </condition>

    <condition id="AT32F407AVCT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407AVCT7"/>
    </condition>

    <condition id="AT32F407AVGT7">
      <require Dvendor="ArteryTek:143" Dname="AT32F407AVGT7"/>
    </condition>

    <condition id="AT32F421C8T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421C8T7"/>
    </condition>

    <condition id="AT32F421C6T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421C6T7"/>
    </condition>

    <condition id="AT32F421C4T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421C4T7"/>
    </condition>

    <condition id="AT32F421K8T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K8T7"/>
    </condition>

    <condition id="AT32F421K6T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K6T7"/>
    </condition>

    <condition id="AT32F421K4T7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K4T7"/>
    </condition>

    <condition id="AT32F421K8U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K8U7"/>
    </condition>

    <condition id="AT32F421K6U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K6U7"/>
    </condition>

    <condition id="AT32F421K4U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K4U7"/>
    </condition>

    <condition id="AT32F421K8U7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K8U7-4"/>
    </condition>

    <condition id="AT32F421K6U7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K6U7-4"/>
    </condition>

    <condition id="AT32F421K4U7-4">
      <require Dvendor="ArteryTek:143" Dname="AT32F421K4U7-4"/>
    </condition>

    <condition id="AT32F421F8P7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F8P7"/>
    </condition>

    <condition id="AT32F421F6P7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F6P7"/>
    </condition>

    <condition id="AT32F421F4P7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F4P7"/>
    </condition>

    <condition id="AT32F421PF8P7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421PF8P7"/>
    </condition>

    <condition id="AT32F421PF4P7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421PF4P7"/>
    </condition>

    <condition id="AT32F421F8U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F8U7"/>
    </condition>

