xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
    <condition id="AT32F421F6U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F6U7"/>
    </condition>

    <condition id="AT32F421F4U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421F4U7"/>
    </condition>

    <condition id="AT32F421G8U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421G8U7"/>
    </condition>

    <condition id="AT32F421G6U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421G6U7"/>
    </condition>

    <condition id="AT32F421G4U7">
      <require Dvendor="ArteryTek:143" Dname="AT32F421G4U7"/>
    </condition>

    <condition id="AT32F4_SYSCFG">
      <description>ArteryTek System config Series devices</description>
      <accept condition="AT32F421xx"/>
    </condition>

    <condition id="AT32F4_GPIO_EX">
      <description>ArteryTek GPIO expend Series devices</description>
      <accept condition="AT32F421xx"/>
    </condition>

    <condition id="AT32F4_GPIO">
      <description>ArteryTek GPIO expend Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32F415xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_ERTC">
      <description>ArteryTek Enhance RTC Series devices</description>
      <accept condition="AT32F415xx"/>
      <accept condition="AT32F421xx"/>
    </condition>

    <condition id="AT32F4_RTC">
      <description>ArteryTek RTC Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_BKPR">
      <description>ArteryTek BKP Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_OTG">
      <description>ArteryTek OTG Series devices</description>
      <accept  condition="AT32F415xx"/>
    </condition>

    <condition id="AT32F4_USB">
      <description>ArteryTek Enhance RTC Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_ACC">
      <description>ArteryTek ACC Series devices</description>
      <accept condition="AT32F413xx"/>
      <accept condition="AT32F415xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_XMC">
      <description>ArteryTek XMC Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_DAC">
      <description>ArteryTek DAC Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_SDIO">
      <description>ArteryTek SDIO Series devices</description>
      <accept condition="AT32F403xx"/>
      <accept condition="AT32F413xx"/>
      <accept  condition="AT32F415xx"/>
      <accept condition="AT32F403Axx"/>
      <accept condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4_COMP">
      <description>ArteryTek Enhance RTC Series devices</description>
      <accept  condition="AT32F415xx"/>
      <accept  condition="AT32F421xx"/>
    </condition>

    <condition id="AT32F4_ETH">
      <description>ArteryTek Enhance ETH Series devices</description>
      <accept  condition="AT32F407xx"/>
    </condition>

    <condition id="AT32F4xx CMSIS">                                   <!-- conditions selecting Devices -->
      <description>ArteryTek AT32F4xx Series devices</description>
      <accept condition="AT32F4"/>
      <accept condition="TS32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Csub=""/>
    </condition>

    <condition id="AT32F4xx STDPERIPH">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers</description>
      <require condition="AT32F4xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH RCC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with RCC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH RTC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with RTC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_RTC"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH ERTC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with ERTC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_ERTC"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ERTC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH BKPR">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with BKP</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_BKPR"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKPR"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH GPIO">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with GPIO</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_GPIO"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH GPIO Ex">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with GPIO_EX</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_GPIO_EX"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO_EX"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH SYSCFG">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with SYSCFG</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_SYSCFG"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SYSCFG"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH SDIO">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with SDIO</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_SDIO"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO"/>
    </condition>

