xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
    <condition id="AT32F4xx STDPERIPH OTG">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with OTG</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_OTG"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="OTG"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH USB">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with USB</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_USB"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USB"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH ACC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with ACC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_ACC"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ACC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH COMP">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with COMP</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_COMP"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="COMP"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH XMC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with XMC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_XMC"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="XMC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH DAC">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with DAC</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_DAC"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC"/>
    </condition>

    <condition id="AT32F4xx STDPERIPH ETH">
      <description>ArteryTek AT32F4xx Standard Peripherals Drivers with ETH</description>
      <require condition="AT32F4xx STDPERIPH"/>
      <require condition="AT32F4xx STDPERIPH RCC"/>
      <require condition="AT32F4_ETH"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ETH"/>
    </condition>

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="AT32F4xx CMSIS">
      <description>Startup File for ArteryTek AT32F4xx Series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>

        <file category="source"  name="Device/Source/ARM/startup_at32f403cx_md.s" attr="config" condition="AT32F403 CX MD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403cx_hd.s" attr="config" condition="AT32F403 CX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403rx_hd.s" attr="config" condition="AT32F403 RX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403vx_hd.s" attr="config" condition="AT32F403 VX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403zx_hd.s" attr="config" condition="AT32F403 ZX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403cx_xl.s" attr="config" condition="AT32F403 CX XL" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403rx_xl.s" attr="config" condition="AT32F403 RX XL" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403vx_xl.s" attr="config" condition="AT32F403 VX XL" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403zx_xl.s" attr="config" condition="AT32F403 ZX XL" version="1.0.1"/>

        <file category="source"  name="Device/Source/ARM/startup_at32f413kx_hd.s" attr="config" condition="AT32F413 KX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413kx_md.s" attr="config" condition="AT32F413 KX MD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413cx_hd.s" attr="config" condition="AT32F413 CX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413cx_md.s" attr="config" condition="AT32F413 CX MD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413rx_hd.s" attr="config" condition="AT32F413 RX HD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413rx_md.s" attr="config" condition="AT32F413 RX MD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f413tx_md.s" attr="config" condition="AT32F413 TX MD" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_ts32f401cbu7.s" attr="config" condition="TS32F401CBU7" version="1.0.1"/>

        <file category="source"  name="Device/Source/ARM/startup_at32f415k8u7-4.s" attr="config" condition="AT32F415K8U7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415kbu7-4.s" attr="config" condition="AT32F415KBU7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415kcu7-4.s" attr="config" condition="AT32F415KCU7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415c8t7.s" attr="config" condition="AT32F415C8T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415cbt7.s" attr="config" condition="AT32F415CBT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415cbu7.s" attr="config" condition="AT32F415CBU7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415cct7.s" attr="config" condition="AT32F415CCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415ccu7.s" attr="config" condition="AT32F415CCU7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415r8t7.s" attr="config" condition="AT32F415R8T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415rbt7.s" attr="config" condition="AT32F415RBT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415rct7.s" attr="config" condition="AT32F415RCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415r8t7-7.s" attr="config" condition="AT32F415R8T7-7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415rbt7-7.s" attr="config" condition="AT32F415RBT7-7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f415rct7-7.s" attr="config" condition="AT32F415RCT7-7" version="1.0.1"/>

