xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
        <file category="source"  name="Device/Source/ARM/startup_at32f403acct7.s" attr="config" condition="AT32F403ACCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403acet7.s" attr="config" condition="AT32F403ACET7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403acgt7.s" attr="config" condition="AT32F403ACGT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403accu7.s" attr="config" condition="AT32F403ACCU7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403aceu7.s" attr="config" condition="AT32F403ACEU7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403acgu7.s" attr="config" condition="AT32F403ACGU7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403arct7.s" attr="config" condition="AT32F403ARCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403aret7.s" attr="config" condition="AT32F403ARET7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403argt7.s" attr="config" condition="AT32F403ARGT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403avct7.s" attr="config" condition="AT32F403AVCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403avet7.s" attr="config" condition="AT32F403AVET7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f403avgt7.s" attr="config" condition="AT32F403AVGT7" version="1.0.1"/>

        <file category="source"  name="Device/Source/ARM/startup_at32f407rct7.s" attr="config" condition="AT32F407RCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407ret7.s" attr="config" condition="AT32F407RET7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407rgt7.s" attr="config" condition="AT32F407RGT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407vct7.s" attr="config" condition="AT32F407VCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407vet7.s" attr="config" condition="AT32F407VET7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407vgt7.s" attr="config" condition="AT32F407VGT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407avct7.s" attr="config" condition="AT32F407AVCT7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f407avgt7.s" attr="config" condition="AT32F407AVGT7" version="1.0.1"/>

        <file category="source"  name="Device/Source/ARM/startup_at32f421c4t7.s" attr="config" condition="AT32F421C4T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421c6t7.s" attr="config" condition="AT32F421C6T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421c8t7.s" attr="config" condition="AT32F421C8T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k4t7.s" attr="config" condition="AT32F421K4T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k6t7.s" attr="config" condition="AT32F421K6T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k8t7.s" attr="config" condition="AT32F421K8T7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k4u7.s" attr="config" condition="AT32F421K4U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k6u7.s" attr="config" condition="AT32F421K6U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k8u7.s" attr="config" condition="AT32F421K8U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k4u7-4.s" attr="config" condition="AT32F421K4U7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k6u7-4.s" attr="config" condition="AT32F421K6U7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421k8u7-4.s" attr="config" condition="AT32F421K8U7-4" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f4p7.s" attr="config" condition="AT32F421F4P7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f6p7.s" attr="config" condition="AT32F421F6P7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f8p7.s" attr="config" condition="AT32F421F8P7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421pf4p7.s" attr="config" condition="AT32F421PF4P7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421pf8p7.s" attr="config" condition="AT32F421PF8P7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f4u7.s" attr="config" condition="AT32F421F4U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f6u7.s" attr="config" condition="AT32F421F6U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421f8u7.s" attr="config" condition="AT32F421F8U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421g4u7.s" attr="config" condition="AT32F421G4U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421g6u7.s" attr="config" condition="AT32F421G6U7" version="1.0.1"/>
        <file category="source"  name="Device/Source/ARM/startup_at32f421g8u7.s" attr="config" condition="AT32F421G8U7" version="1.0.1"/>
      </files>
    </component>

