xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
    <component Cclass="Device" Cgroup="System_AT32Fxx" Cversion="1.0.1" condition="AT32F4xx CMSIS">
      <description>System Clock Config File for ArteryTek AT32F4xx</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_at32f4xx.c"  attr="config" version="1.0.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.1" condition="AT32F4xx STDPERIPH">
      <description>Standard Peripherals Drivers Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="include" name="Device\StdPeriph_Driver\inc\"/>
        <file category="include" name="Device\StdPeriph_Driver\templates\"/>
        <file category="source"  name="Device\StdPeriph_Driver\src\misc.c"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\at32f4xx_conf.h" attr="config" version="1.0.1"/>
        <file category="include" name="Device\StdPeriph_Driver\templates\at32f4xx_it.h"   attr="template" select="Interrupt Service Routines"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\at32f4xx_it.c"   attr="template" select="Interrupt Service Routines"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_wwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_wwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_usart.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIMER" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Timers (TIMER) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_tim.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_tim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_spi.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.1" condition="AT32F4xx STDPERIPH SDIO">
      <description>Secure digital (SDIO) interface driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_sdio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_sdio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Analog-to-digital converter (ADC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_adc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_adc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKPR" Cversion="1.0.1" condition="AT32F4xx STDPERIPH BKPR">
      <description>Backup registers (BKPR) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_bkp.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_bkp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Controller area network (CAN) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_can.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>CRC calculation unit (CRC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_crc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH DAC">
      <description>Digital-to-analog converter (DAC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_dac.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_dac.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="MCUDBG" Cversion="1.0.1" condition="AT32F4xx STDPERIPH">
      <description>MCU debug component (MCUDBG) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBGMCU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_dbgmcu.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_dbgmcu.c"/>
      </files>
    </component>

