xiaocainiao11111/x_track_learn/X-Track(注释版)/Keil.AT32F4xx_DFP.1.3.7/Keil.AT32F4xx_DFP.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>DMA controller (DMA) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_dma.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_dma.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>External interrupt/event controller (EXTI) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_exti.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_exti.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Embedded Flash memory driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_flash.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_flash.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="XMC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH XMC">
      <description>Flexible Static Memory Controller (XMC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FSMC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_xmc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_xmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.1" condition="AT32F4xx STDPERIPH GPIO">
      <description>General-purpose I/O (GPIO) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_gpio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO_EX" Cversion="1.0.1" condition="AT32F4xx STDPERIPH GPIO Ex">
      <description>General-purpose I/O (GPIO) expend driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO_EX
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_gpio_ex.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_gpio_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SYSCFG" Cversion="1.0.1" condition="AT32F4xx STDPERIPH SYSCFG">
      <description>System config (SYSCFG) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SYSCFG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_syscfg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_syscfg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_i2c.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_i2c.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG" Cversion="1.0.1" condition="AT32F4xx STDPERIPH">
      <description>Independent watchdog (IWDG) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_iwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_iwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RCC">
      <description>Power controller (PWR) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_pwr.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_pwr.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH">
      <description>Reset and clock control (RCC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_rcc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_rcc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH RTC">
      <description>Real-time clock (RTC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_rtc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_rtc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ERTC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH ERTC">
      <description>Enhance Real-time clock (ERTC) driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ERTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_ertc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_ertc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="COMP" Cversion="1.0.1" condition="AT32F4xx STDPERIPH COMP">
      <description>Comparator driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_comp.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_comp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ACC" Cversion="1.0.1" condition="AT32F4xx STDPERIPH ACC">
      <description>ACC driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ACC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_acc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_acc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ETH" Cversion="1.0.1" condition="AT32F4xx STDPERIPH ETH">
      <description>ETH driver for AT32F4xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ETH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\at32f4xx_eth.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\at32f4xx_eth.c"/>
      </files>
    </component>

  </components>

</package>
